#Использовать asserts
#Использовать "../src"

Перем ЮнитТест;


// Процедура выполняется перед запуском теста
//
Процедура ПередЗапускомТеста() Экспорт
	
	
КонецПроцедуры // ПередЗапускомТеста()

Функция МутацииДляТеста()

	Мутант = ЗагрузитьСценарий("src/Мутанты/ЗаменаБулевыхОперандов.os");
	Мутации = Новый Массив;
	Мутации.Добавить(Мутант);

	Возврат Мутации;

КонецФункции

// Функция возвращает список тестов для выполнения
//
// Параметры:
//    Тестирование    - Тестер        - Объект Тестер (1testrunner)
//    
// Возвращаемое значение:
//    Массив        - Массив имен процедур-тестов
//    
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	СписокТестов = Новый Массив;

	СписокТестов.Добавить("ТестДолжен_СформироватьЗаменитьИ");
	СписокТестов.Добавить("ТестДолжен_СформироватьЗаменитьИЛИ");
	СписокТестов.Добавить("ТестДолжен_СформироватьЗаменитьНЕ");

	Возврат СписокТестов;

КонецФункции

Процедура ТестДолжен_СформироватьМутанта(ИсходныйКод, КонтрольноеЗначение)

	Мутации = МутацииДляТеста();
	Результат = Кодогенерация.ВыполнитьЗаменыВКоде(ИсходныйКод, Мутации);

	Ожидаем.Что(Результат.Количество(), "Должна быть одна мутация").Равно(1);
	Для Каждого ИмяКод Из Результат Цикл

		Ожидаем.Что(ИмяКод.Значение).Равно(КонтрольноеЗначение);

	КонецЦикла;

КонецПроцедуры

Процедура ТестДолжен_СформироватьЗаменитьИ() Экспорт

	ТестДолжен_СформироватьМутанта("а = Истина И Ложь;", "а = Истина ИЛИ Ложь;");

КонецПроцедуры

Процедура ТестДолжен_СформироватьЗаменитьИЛИ() Экспорт

	ТестДолжен_СформироватьМутанта("а = Истина ИЛИ Ложь;", "а = Истина И Ложь;");

КонецПроцедуры

Процедура ТестДолжен_СформироватьЗаменитьНЕ() Экспорт

	ТестДолжен_СформироватьМутанта("а = НЕ Истина;", "а =  Истина;");

КонецПроцедуры

КодСтрока = "Результат = ""Привет""";
КодСтрокаНов = "Результат = ""xxПриветxx""";
